Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: Just use them as you would in vanilla Hibernate ORM (see documentation linked above), and rely on CDI features (`@Inject`, `@PostConstruct`, `@PreDestroy`, ...) in the converter/listener implementation as needed.
ja_jp: 通常の Hibernate ORM と同じように使用し (上記のリンク先ドキュメントを参照)、コンバーター/リスナーの実装内で必要に応じて CDI 機能 ( `@Inject` 、 `@PostConstruct` 、 `@PreDestroy` など) を利用してください。

source: Kafka - Add support for Confluent Schema Registry
ja_jp: Kafka - Confluent Schema Registry のサポートを追加

source: Kafka - When to commit?
ja_jp: Kafka - いつコミットするのか？

source: Kafka Broker Readiness Check
ja_jp: Kafka ブローカー rediness チェック

source: Kafka Client
ja_jp: Kafkaクライアント

source: Kafka Client Dev UI
ja_jp: KafkaクライアントDev UI

source: Kafka Configuration Resolution
ja_jp: Kafka 設定の解決

source: Kafka Connector for Reactive Messaging: allows implementing applications consuming and writing Kafka records
ja_jp: Kafka Connector for Reactive Messaging: Kafkaのレコードを消費したり書いたりするアプリケーションを実装できます。

source: Kafka Dev UI is part of the Quarkus Dev UI and is only available in development mode.
ja_jp: Kafka Dev UIはQuarkus Dev UIの一部で、開発モードでのみ利用可能です。

source: Kafka Reactive Messaging Health Checks
ja_jp: Kafka Reactive Messaging ヘルスチェック

source: Kafka Streams Health Checks
ja_jp: Kafka Streams のヘルスチェック

source: Kafka Streams metrics are now exposed.
ja_jp: Kafka Streams のメトリクスが公開されました。

source: Kafka Transactions
ja_jp: Kafka トランザクション

source: Kafka Transactions allows managing consumer offsets inside a transaction, together with produced messages. This enables coupling a consumer with a transactional producer in a _consume-transform-produce_ pattern, also known as *exactly-once processing*.
ja_jp: Kafka Transactions を使用すると、生成されたメッセージとともに、トランザクション内のコンシューマーオフセットを管理できます。これにより、コンシューマーとトランザクションプロデューサーを _consume-transform-produce_ パターンでカップリングすることができます。これは *exactly-once 処理* としても知られています。

source: Kafka broker and Apicurio Registry instance are started automatically thanks to Dev Services. See xref:kafka-dev-services.adoc[Dev Services for Kafka] and xref:apicurio-registry-dev-services.adoc[Dev Services for Apicurio Registry] for more details.
ja_jp: Dev Services により、Kafka ブローカーと Apicurio Registry インスタンスは自動的に開始されます。詳細については、xref:kafka-dev-services.adoc[Dev Services for Kafka] および xref:apicurio-registry-dev-services.adoc[Dev Services for Apicurio Registry] を参照してください。

source: Kafka client extension integrates with the xref:./tls-registry-reference.adoc[Quarkus TLS registry] to configure clients.
ja_jp: Kafka クライアントエクステンションは、xref:./tls-registry-reference.adoc[Quarkus TLS レジストリー] と統合してクライアントを設定します。

source: Kafka consumers provide a similar feature to pause and resume the consumption of messages from topic-partitions. The Quarkus Kafka connector allows xref:kafka.adoc#kafka-bare-clients[access to the underlying client] to pause/resume the consumption.
ja_jp: Kafka コンシューマーは、トピックパーティションからのメッセージの消費を一時停止および再開するための同様の機能を提供します。 Quarkus Kafka コネクターを使用すると、xref:kafka.adoc#kafka-bare-clients[基盤となるクライアントにアクセス] して消費を一時停止/再開できます。

source: Kafka now has metrics
ja_jp: Kafka へのメトリクスの実装

source: Kafka organizes records (_i.e._ messages) around _topics_. Each topic has a name, and applications send records to topics and poll records from topics. So far, nothing out of the ordinary.
ja_jp: Kafka は、 _トピックを_ 中心にレコード ( _即ち_ メッセージ) を整理します。各トピックには名前があり、アプリケーションはトピックにレコードを送り、トピックからレコードをポーリングします。今のところ、特別なことは何もありません。

source: Kafka reactive messaging connector
ja_jp: Kafka リアクティブメッセージングコネクター

source: Kafka transactional producers require configuring `acks=all` client property, and a unique id for `transactional.id`, which implies `enable.idempotence=true`. When Quarkus detects the use of `KafkaTransactions` for an outgoing channel it configures these properties on the channel, providing a default value of `"${quarkus.application.name}-${channelName}"` for `transactional.id` property.
ja_jp: Kafka トランザクションプロデューサーでは、 `acks=all` クライアントプロパティーと `transactional.id` の一意の ID を設定する必要があります。これは、 `enable.idempotence=true` を意味します。 Quarkus が送信チャネルの `KafkaTransactions` の使用を検出すると、チャンネルでこれらのプロパティーを設定し、 `transactional.id` プロパティーに `"${quarkus.application.name}-${channelName}"` のデフォルト値を提供します。

source: Kafka transactions enable atomic writes to multiple Kafka topics and partitions. The Kafka connector provides `KafkaTransactions` custom emitter for writing Kafka records inside a transaction. It can be injected as a regular emitter `@Channel`:
ja_jp: Kafka トランザクションにより、複数の Kafka トピックおよびパーティションへのアトミックな書き込みが可能になります。Kafka コネクターは、トランザクション内に Kafka レコードを書き込むための `KafkaTransactions` カスタムエミッターを提供します。これは、通常のエミッター `@Channel` として注入することができます。

source: Kafka: Provides the `ssl.engine.factory.class` property for the Kafka client.
ja_jp: Kafka: Kafka クライアントに `ssl.engine.factory.class` プロパティーを提供します。

source: Kbytes: Size (kilobytes) of virtual address space reserved for region
ja_jp: Kbytes(キロバイト): リージョン用に予約された仮想アドレス空間のサイズ (キロバイト)

source: Kebab-case - the method name is derived by replacing case changes with a dash to map the configuration property.
ja_jp: Kebab-case - メソッド名は、設定プロパティーをマッピングするために、大文字と小文字の変化をダッシュに置き換えることで派生します。

source: Keep ID, access and refresh tokens
ja_jp: ID、アクセス、およびリフレッシュトークンを保持する

source: Keep all or some of ID, access and refresh tokens
ja_jp: ID、アクセス、リフレッシュトークンのすべて、または一部を保持する

source: Keep confidential your database credentials by storing them in Vault.
ja_jp: データベースの資格情報をVaultに保存して、機密を保持します。

source: Keep in mind however that the information above does **not** apply to pre-matching filters (`@ServerRequestFilter(preMatching = true)`). These filters are *always* run on an event-loop thread.
ja_jp: ただし、上記の情報は事前一致フィルター (`@ServerRequestFilter (preMatching = true)`) には **適用されない** ことに注意してください。 これらのフィルターは、*常に* イベントループスレッドで実行されます。

source: Keep in mind that annotation transformers must be produced _before_ the bean discovery starts.
ja_jp: アノテーショントランスフォーマーは、Beanディスカバリが始まる _前に_ 生成されなければならないことを覚えておいてください。

source: Keep in mind that not everybody will need JSON, so you need to make it optional.
ja_jp: すべての人がJSONを必要とするわけではないことを覚えておいてください。そのため、オプションとする必要があります。

source: Keep in mind that reflection may not work correctly in some restricted environments or may require additional configuration, e.g. registration in case of a GraalVM native image.
ja_jp: リフレクションは、一部の制限された環境では正しく動作しないか、GraalVM ネイティブイメージの場合の登録など、追加の設定が必要な場合があることに留意してください。

source: Keep in mind that the reflection-based value resolver has priority `-1` and the max priority value for resolvers generated from <<template_data,`@TemplateData`>> and <<typesafe_expressions,type-safe expressions>> is `10`.
ja_jp: リフレクションベースの値リゾルバーの優先度は -1 であり、 <<template_data,`@TemplateData`>> から生成されたリゾルバーの最大優先度値および <<typesafe_expressions,type-safe expressions>> は `10` です。

source: Keep in mind that the variable is not available outside the `let` section that defines it.
ja_jp: この変数は、 `let` セクションを定義している外では利用できないことに留意してください。

source: Keep in mind that this service does not provide scalability. A container instance is unique and does not scale.
ja_jp: このサービスはスケーラビリティを提供しないことを覚えておいてください。コンテナーインスタンスは単一であり、スケーラビリティを提供しません。

source: Keep in mind that you usually don't want to expose to the public the internals of your services - and especially not the validated value contained in the violation object.
ja_jp: 通常、サービスの内部、特に違反オブジェクトに含まれる検証された値を公開したくないことに留意してください。

source: Keep in mind that you usually don't want to expose to the public the internals of your services -- and especially not the validated value contained in the violation object.
ja_jp: 通常、サービスの内部、特に違反オブジェクトに含まれる検証済み値を一般に公開したくないということを念頭に置いてください。

source: Keep in mind that, except if configured otherwise (see below), a Dev Service runs on a random port. For instance, when you run PostgreSQL as a Dev Service and have `psql` installed on the host, you can connect via:
ja_jp: 特に設定されている場合 (以下を参照) を除き、Dev Service はランダムなポートで実行されることに注意してください。たとえば、PostgreSQL を Dev Service として実行し、ホストに `psql` がインストールされている場合、次の方法で接続できます。

source: Keep in mind this style of declaration allows you to reference templates declared in other resources too:
ja_jp: このスタイルの宣言では、他のリソースで宣言されたテンプレートも参照できることを覚えておいてください。

source: Keep rocking the Java world!
ja_jp: これからもJavaの世界をロックを続けてください

source: Keep the ID and refresh tokens only
ja_jp: ID とリフレッシュトークンのみを保存する場合

source: Keep the ID token only
ja_jp: ID トークンのみを保存する場合

source: Keep the application running and request your first Let's Encrypt certificate.
ja_jp: アプリケーションを実行したまま、最初の Let's Encrypt 証明書をリクエストします。

source: Kerberos ticket
ja_jp: Kerberos チケット

source: Key LambdaHttpApi Description URL for application Value https://234asdf234as.execute-api.us-east-1.amazonaws.com/
ja_jp: Key LambdaHttpApi Description アプリケーションの URL Value https://234asdf234as.execute-api.us-east-1.amazonaws.com/

source: Key Features
ja_jp: 主な特長

source: Key Highlights in 1.0.0.Alpha2
ja_jp: 1.0.0.Alpha2 における主なハイライト

source: Key Points
ja_jp: 主なポイント

source: Key cache entry time-to-live in minutes. Use this property and `smallrye.jwt.key-cache-size` to control the key cache when a key provider such as `AWS_ALB` is configured with `smallrye.jwt.verify.key-provider=AWS_ALB` for resolving the keys dynamically.
ja_jp: キーキャッシュエントリーの有効期間 (分単位)。 `AWS_ALB` などのキープロバイダーが `smallrye.jwt.verify.key-provider=AWS_ALB` で設定され、キーが動的に解決される場合、このプロパティーと `smallrye.jwt.key-cache-size` を使用してキーキャッシュを制御します。

source: Key cache entry time-to-live in minutes. Use this property, as well as `smallrye.jwt.key-cache-size`, to control the key cache when a key provider such as `AWS_ALB` is configured with `smallrye.jwt.verify.key-provider=AWS_ALB` for resolving the keys dynamically.
ja_jp: キー・キャッシュ・エントリーの有効期限を分単位で示します。このプロパティは、 `smallrye.jwt.key-cache-size` と同様に、 `AWS_ALB` のようなキー・プロバイダが鍵を動的に解決するために `smallrye.jwt.verify.key-provider=AWS_ALB` で構成されている場合に、キー・キャッシュを制御するために使用します。

source: Key cache size. Use this property and `smallrye.jwt.key-cache-time-to-live` to control the key cache when a key provider such as `AWS_ALB` is configured with `smallrye.jwt.verify.key-provider=AWS_ALB` for resolving the keys dynamically.
ja_jp: キーキャッシュのサイズ。このプロパティは、 `smallrye.jwt.key-cache-time-to-live` と同様に、 `AWS_ALB` のようなキープロバイダーが、鍵を動的に解決するために `smallrye.jwt.verify.key-provider=AWS_ALB` で構成されている場合に、キーキャッシュを制御するために使用します。

source: Key cache size. Use this property, as well as `smallrye.jwt.key-cache-time-to-live`, to control the key cache when a key provider such as `AWS_ALB` is configured with `smallrye.jwt.verify.key-provider=AWS_ALB` for resolving the keys dynamically.
ja_jp: キー・キャッシュのサイズ。このプロパティは、 `smallrye.jwt.key-cache-time-to-live` と同様に、 `AWS_ALB` のようなキー・プロバイダが、鍵を動的に解決するために `smallrye.jwt.verify.key-provider=AWS_ALB` で構成されている場合に、キー・キャッシュを制御するために使用します。

source: Key encryption algorithm. Checked if the JWT encryption builder has not already set the key encryption algorithm.
ja_jp: キー暗号化アルゴリズム。JWT 暗号化ビルダーがキー暗号化アルゴリズムをまだ設定していないかどうかを確認します。

source: Key encryption algorithm. This property will be checked if the JWT encryption builder has not already set the key encryption algorithm.
ja_jp: キー暗号化アルゴリズム。このプロパティーは、JWT 暗号化ビルダーがキー暗号化アルゴリズムをまだ設定していない場合にチェックされます。

source: Key features of Quarkus Security
ja_jp: Quarkus Securityの主な機能

source: Key fields:
ja_jp: 主要なフィールド:

source: Key identifier. If it is set then the verification JWK key as well every JWT token must have a matching `kid` header.
ja_jp: 鍵の識別子。設定されている場合、検証 JWK 鍵とすべての JWT トークンには、一致する `kid` ヘッダーが必要です。

source: Key identifier. The verification JWK key and every JWT token must have a matching `kid` header if it is set.
ja_jp: 鍵の識別子。検証 JWK キーとすべての JWT トークンには、設定されている場合は一致する `kid` ヘッダーが必要です。

source: Key store, trust store and certificate files can be reloaded periodically. Configure the `quarkus.http.ssl.certificate.reload-period` property to specify the interval at which the certificates should be reloaded:
ja_jp: きーストア、トラスト・ストア、および証明書ファイルは、定期的にリロードできます。 `quarkus.http.ssl.certificate.reload-period` プロパティを設定して、証明書をリロードする間隔を指定します：

source: Key store, trust store and certificate files can be reloaded periodically. Configure the `quarkus.management.ssl.certificate.reload-period` property to specify the interval at which the certificates should be reloaded:
ja_jp: キーストア、トラストストア、および証明書ファイルは、定期的にリロードできます。 `quarkus.management.ssl.certificate.reload-period` プロパティーを設定して、証明書をリロードする間隔を指定します。

source: Key stores
ja_jp: キーストア

source: Key stores are used to store private keys and the certificates. They are mainly used on the server side but can also be used on the client side when mTLS is used.
ja_jp: キーストアは、秘密鍵と証明書を保存するために使用されます。 これらは主にサーバー側で使用されますが、mTLS を使用する場合はクライアント側でも使用できます。

source: Key stores store private keys and certificates. They are mainly used on the server side but can also be used on the client side when mTLS is used.
ja_jp: キーストアには秘密鍵と証明書が保存されます。 これらは主にサーバー側で使用されますが、mTLS を使用する場合はクライアント側でも使用できます。

source: Key stores store private keys and certificates. They are mainly used on the server side, but can also be used on the client side when mTLS is used.
ja_jp: キーストアには秘密鍵と証明書が保存されます。これらは主にサーバー側で使用されますが、mTLS を使用する場合はクライアント側でも使用できます。

source: Key value used to encrypt the claims or the inner JWT when a no-argument `encrypt()` method is called.
ja_jp: 引数なしの `encrypt()` メソッドが呼び出されたときにクレームまたは内部 JWT を暗号化するために使用されるキー値。

source: Key value used to sign the claims when either a no-argument `sign()` or `innerSign()` method is called.
ja_jp: 引数なしの `sign()` または `innerSign()` メソッドが呼び出されたときにクレームに署名するために使用されるキー値。

source: Key value which will be used to encrypt the claims or inner JWT when a no-argument encrypt() method is called.
ja_jp: 引数なし `encrypt()` メソッドが呼び出された際に、クレームまたは内部 JWT を暗号化するために使用されるキー値。

source: Key value which will be used to sign the claims when either a no-argument sign() or innerSign() method is called.
ja_jp: 引数なし `sign()` または `innerSign()` メソッドが呼び出されたときに、クレームに署名するために使用されるキー値。

source: Key values must be a primitive type (except char) or `String`. Values can be primitives (except char), `String`, `OffsetDateTime` or a complex bean style class. For the above example, here's the corresponding curl request:
ja_jp: キー値は、プリミティブ型(char を除く)か `String` でなければなりません。値は、プリミティブ型 (char を除く)、 `String` 、 `OffsetDateTime` 、または複雑な Bean スタイルのクラスを使用できます。上記の例に対して、対応する curl リクエストを以下に示します。

source: Key/value pairs
ja_jp: キーと値のペア

source: Keycloak Authorization Services feature is enabled in your Keycloak instance.
ja_jp: Keycloak認可サービス機能がKeycloakインスタンスで有効になっています。

source: Keycloak Authorization Services is enabled in your Keycloak instance.
ja_jp: Keycloak インスタンスで Keycloak Authorization Services が有効化されている。

source: Keycloak Dev Services configuration
ja_jp: Keycloak 開発サービスの設定

source: Keycloak Initialization
ja_jp: Keycloak 初期化

source: Keycloak admin client
ja_jp: Keycloak adminクライアント

source: Keycloak evaluates permissions for each request based on its configured policies.
ja_jp: Keycloak は、設定されたポリシーに基づいて各リクエストの権限を評価します。

source: Keycloak initialization
ja_jp: Keycloak 初期化

source: Keycloak might return an error when you try to *Log into Single Page Application*. For example, `quarkus.oidc.client-id` might not match the client ID in the realm imported to Keycloak, or the client in this realm might not be configured correctly to support the authorization code flow. In such cases, Keycloak returns an `error_description` query parameter, and the Dev UI also shows this error description. For example:
ja_jp: *Log into Single Page Application* を選択しすると、Keycloak からエラーが返される場合があります。 たとえば、`quarkus.oidc.client-id` が Keycloak にインポートされたレルム内のクライアント ID と一致しない可能性があります。または、このレルム内のクライアントが認可コードフローをサポートするように正しく設定されていない可能性があります。 このような場合、Keycloak は `error_description` クエリーパラメーターを返し、Dev UI にもこのエラーの説明が表示されます。 次に例を示します。

source: Keys and values are separated by the equals sign.
ja_jp: キーと値は等号で区切られています。

source: Keys are used directly in templates. The bundle name is used as a namespace in template expressions. The `@MessageBundle` can be used to define the default strategy used to generate message keys from method names. However, the `@Message` can override this strategy and even define a custom key. By default, the annotated element's name is used as-is. Other possibilities are:
ja_jp: キーはテンプレート内で直接使用されます。バンドル名はテンプレート式の名前空間として使用されます。 `@MessageBundle` は、メソッド名からメッセージキーを生成するために使用されるデフォルトのストラテジーを定義するために使用することができます。しかし、 `@Message` はこのストラテジーをオーバーライドし、カスタム・キーを定義することもできます。デフォルトでは、アノテーションされた要素の名前がそのまま使用されます。他の可能性としては、以下のようなものがあります。

source: Keystore password. If `mp.jwt.verify.publickey.location` or `mp.jwt.decrypt.key.location` then this property has be set.
ja_jp: キーストアのパスワード。 `mp.jwt.verify.publickey.location` または `mp.jwt.decrypt.key.location` の場合、このプロパティーが設定されています。

source: Keystore password. If `mp.jwt.verify.publickey.location` or `mp.jwt.decrypt.key.location`, this property must be set.
ja_jp: キーストアのパスワード。 `mp.jwt.verify.publickey.location` または `mp.jwt.decrypt.key.location` の場合は、このプロパティーを設定する必要があります。

source: Keystore password. If `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` point to a `KeyStore` file then this property has be set.
ja_jp: キーストアのパスワード。 `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` が `KeyStore` ファイルを指している場合、このプロパティを設定する必要があります。

source: Keystore password. If `smallrye.jwt.sign.key.location` or `smallrye.jwt.encrypt.key.location` point to a `KeyStore` file, this property must be set.
ja_jp: キーストアのパスワード。 `smallrye.jwt.sign.key.location` または `smallrye.jwt.encrypt.key.location` が `KeyStore` ファイルを指している場合は、このプロパティーを設定する必要があります。

source: Keystores and truststores are accessible.
ja_jp: キーストアとトラストストアにアクセスできる。

source: Keywords that can be used to search for extensions in the extension catalog provided by the dev tools to the users
ja_jp: 開発ツールがユーザーに提供するエクステンションのカタログから、エクステンションを検索するために使用できるキーワード

source: Kill the existing instance (`kill 2389948`) and rebuild the application (`./mvnw package -DskipTests`) and start it running in the background:
ja_jp: 既存のインスタンスをkillし( `kill 2389948`)、アプリケーションを再ビルドし( `./mvnw package -DskipTests`)、バックグラウンドで実行を開始します。

source: Kill the first service
ja_jp: 最初のサービスをkill

source: Kill the service in preparation for the next step (`kill 2434426`) or just leave it running.
ja_jp: 次のステップに備えてサービスを停止するか（ `kill 2434426` ）、そのまま稼働させておきます。

source: Knative - OpenShift Serverless
ja_jp: Knative - OpenShiftサーバーレス

source: Knock-on effects
ja_jp: ノックオン効果

source: Known Issues in Flyway
ja_jp: Flyway の既知の問題

source: Known limitations
ja_jp: 既知の制限

source: Known previous compatible versions for `apicurio-registry-client` and `apicurio-common-rest-client-vertx` are the following
ja_jp: `apicurio-registry-client` および `apicurio-common-rest-client-vertx` の既知の旧互換バージョンは以下の通りです。

source: Kogito Tooling is currently supported in VSCode, Online and on other platforms:
ja_jp: Kogito Toolingは現在VSCodeでオンラインおよび他のプラットフォームでサポートされています。

source: Kogito Tooling is currently supported via VSCode, web browsers and on other platforms:
ja_jp: Kogito Toolingは現在、VSCode、Webブラウザ、その他のプラットフォームでサポートされています。

source: Kogito allows to define DRL rules as decision tables using the Microsoft Excel file formats. To be able to use such assets in your application, an additional dependency is required:
ja_jp: Kogitoでは、Microsoft Excelファイルフォーマットを使用して、ビジネスルールをディシジョンテーブルとして定義することができます。このようなアセットをアプリケーションで使用するには、追加の依存関係が必要です。

source: Kogito allows to define visually test scenarios, and execute them as JUnit tests as part of the normal build of the Quarkus application.
ja_jp: Kogitoでは、視覚的にテストシナリオを定義し、それをJUnitテストとしてQuarkusアプリケーションの通常のビルドの一部として実行することができます。

source: Kogito and OptaPlanner have been upgraded respectively to 1.17.0.Final and 8.17.0.Final.
ja_jp: KogitoとOptaPlannerがそれぞれ1.17.0.Finalと8.17.0.Finalにアップグレードされました。

source: Kogito and OptaPlanner upgrades
ja_jp: KogitoとOptaPlannerのアップグレード

source: Kogito extensions are back
ja_jp: Kogitoエクステンションが復活

source: Kogito is a next generation business automation toolkit that originates from the well known Open Source project Drools (for predictions). Kogito aims at providing another approach to business automation where the main message is to expose your business knowledge (processes, rules, decisions, predictions) in a domain specific way.
ja_jp: Kogitoは、よく知られたオープンソース・プロジェクトであるDrools（予測のための）から生まれた、次世代のビジネス・オートメーション・ツールキットです。Kogitoは、ビジネス・オートメーションに新しいアプローチを提供することを目的としており、主なメッセージは、ビジネス・ナレッジ（プロセス、ルール、意思決定、予測）をドメイン固有の方法で公開することです。

source: Kogito is a next generation business automation toolkit that originates from well known Open Source projects Drools (for business rules) and jBPM (for business processes). Kogito aims at providing a newer approach to business automation where the main message is to expose your business knowledge (processes, rules, decisions, predictions) in a domain specific way.
ja_jp: Kogitoは、よく知られたオープンソース・プロジェクトであるDrools（ビジネス・ルール用）とjBPM（ビジネス・プロセス用）から生まれた、次世代のビジネス・オートメーション・ツールキットです。Kogitoは、ビジネス・オートメーションに新しいアプローチを提供することを目的としており、主なメッセージは、ビジネス・ナレッジ（プロセス、ルール、決定、予測）をドメイン固有の方法で公開することです。

source: Kogito is a next generation business automation toolkit that originates from well known Open Source projects Drools (for business rules) and jBPM (for business processes). Kogito aims at providing another approach to business automation where the main message is to expose your business knowledge (processes, rules and decisions) in a domain specific way.
ja_jp: Kogitoは、有名なオープンソースプロジェクトであるDrools (ビジネスルール用)とjBPM (ビジネスプロセス用)から生まれた次世代のビジネスオートメーションツールキットです。Kogitoは、ビジネスナレッジ(プロセス、ルール、意思決定)をドメイン固有の方法で公開することを主なメッセージとするビジネスオートメーションへの別のアプローチを提供することを目的としています。

source: Kogito is a next generation business automation toolkit that originates from well known Open Source projects Drools (for business rules) and jBPM (for business processes). Kogito aims at providing another approach to business automation where the main message is to expose your business knowledge (processes, rules, decisions, predictions) in a domain specific way.
ja_jp: Kogitoは、有名なオープンソースプロジェクトであるDrools (ビジネスルール用)とjBPM (ビジネスプロセス用)から生まれた次世代のビジネスオートメーションツールキットです。Kogitoは、ビジネスナレッジ(プロセス、ルール、意思決定、予測)をドメイン固有の方法で公開することを主なメッセージとするビジネスオートメーションへの別のアプローチを提供することを目的としています。

source: Kogito uses Infinispan as the persistence service so you need to have Infinispan server installed and running. Version of the Infinispan is aligned with Quarkus BOM so make sure the right version is installed.
ja_jp: Kogitoでは、永続化サービスとしてInfinispanを使用しているため、Infinispanサーバーがインストールされている必要があります。InfinispanのバージョンはQuarkusのBOMに合わせているので、正しいバージョンがインストールされていることを確認してください。

source: Kogito uses Infinispan as the persistence service, so you need to have Infinispan server installed and running. Version of the Infinispan is aligned with Quarkus BOM so make sure the right version is installed.
ja_jp: Kogitoでは、永続化サービスとしてInfinispanを使用しているため、Infinispanサーバーがインストールされている必要があります。InfinispanのバージョンはQuarkusのBOMに合わせているので、正しいバージョンがインストールされていることを確認してください。

source: Kogito, like Drools, offers support of the https://drools.org/learn/dmn.html[DMN open standard] for visual and semantic execution of declarative logic. The business rules in this example may be also expressed using DMN decision tables or other visual paradigm of DMN, instead of DRL and RuleUnits.
ja_jp: Kogitoは、Droolsのように、宣言型ロジックの視覚的かつ意味的な実行のための link:https://drools.org/learn/dmn.html[DMNオープン・スタンダード]をサポートしています。この例のビジネス・ルールは、DRLやRuleUnitsの代わりに、DMN意思決定テーブルやその他のDMNの視覚的なパラダイムを使って表現することもできます。

source: Kotlin `suspend` function returning `Unit`: Denotes a non-blocking method where no explicit message is sent back to the client.
ja_jp: `Unit` を返す Kotlin の `suspend` 関数: 明示的なメッセージがクライアントに返されないノンブロッキングメソッドを示します。

source: Kotlin `suspend` function returning `Unit`: Denotes a non-blocking method where no explicit response is sent back to the client.
ja_jp: `Unit` を返す Kotlin の `suspend` 関数: 明示的なレスポンスがクライアントに返されないノンブロッキングメソッドを示します。

source: Kotlin `suspend` function returning `Unit`: The method is considered non-blocking.
ja_jp: `Unit` を返す Kotlin の `suspend` 関数: このメソッドはノンブロッキングとみなされます。
